apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_cam.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/spinlock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>
#include <nuttx/video/imgdata.h>

#include <arch/board/board.h>

#include "esp32s3_dma.h"
#include "espressif/esp_gpio.h"
#include "espressif/esp_irq.h"

#include "xtensa.h"
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_gpio_sigmap.h"
#include "hardware/esp32s3_lcd_cam.h"

#include "periph_ctrl.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Use PLL=160MHz as clock resource for CAM */

#define ESP32S3_CAM_CLK_SEL       2
#define ESP32S3_CAM_CLK_MHZ       160

/* XCLK = 160 / (6 + 2/3) = 24 MHz */

#define ESP32S3_CAM_CLKM_DIV_NUM  6
#define ESP32S3_CAM_CLKM_DIV_A    3
#define ESP32S3_CAM_CLKM_DIV_B    2

/* DMA buffer configuration */

#define ESP32S3_CAM_DMA_BUFLEN    4096
#define ESP32S3_CAM_DMADESC_NUM   40

/* VSYNC filter threshold */

#define ESP32S3_CAM_VSYNC_FILTER  4

/* GDMA external memory block size setting for PSRAM RX.
 * Change this single macro to switch between 16B / 32B / 64B.
 * ESP32S3_CAM_DMA_ALIGN is the byte alignment derived from it.
 */

#define ESP32S3_CAM_EXT_MEMBLK    ESP32S3_DMA_EXT_MEMBLK_64B

#if ESP32S3_CAM_EXT_MEMBLK == ESP32S3_DMA_EXT_MEMBLK_64B
#  define ESP32S3_CAM_DMA_ALIGN   64
#elif ESP32S3_CAM_EXT_MEMBLK == ESP32S3_DMA_EXT_MEMBLK_32B
#  define ESP32S3_CAM_DMA_ALIGN   32
#else
#  define ESP32S3_CAM_DMA_ALIGN   16
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32s3_cam_s
{
  struct imgdata_s data;

  bool capturing;

  int cpuint;
  uint8_t cpu;
  int32_t dma_channel;

  struct esp32s3_dmadesc_s *dmadesc; /* Heap-allocated DMA descriptors */

  uint8_t *fb;                    /* Frame buffer */
  uint32_t fb_size;               /* Frame buffer size */
  uint32_t fb_pos;                /* Current write position */
  bool fb_allocated;              /* true if driver allocated fb */
  uint8_t vsync_cnt;              /* VSYNC counter for frame sync */

  imgdata_capture_t cb;           /* Capture done callback */
  void *cb_arg;                   /* Callback argument */

  uint16_t width;
  uint16_t height;
  uint32_t pixfmt;

  spinlock_t lock;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int esp32s3_cam_init(struct imgdata_s *data);
static int esp32s3_cam_uninit(struct imgdata_s *data);
static int esp32s3_cam_set_buf(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               uint8_t *addr, uint32_t size);
static int esp32s3_cam_validate_frame_setting(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               imgdata_interval_t *interval);
static int esp32s3_cam_start_capture(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               imgdata_interval_t *interval,
                               imgdata_capture_t callback,
                               void *arg);
static int esp32s3_cam_stop_capture(struct imgdata_s *data);
static void *esp32s3_cam_alloc(struct imgdata_s *data,
                               uint32_t align_size, uint32_t size);
static void esp32s3_cam_free(struct imgdata_s *data, void *addr);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct imgdata_ops_s g_cam_ops =
{
  .init                   = esp32s3_cam_init,
  .uninit                 = esp32s3_cam_uninit,
  .set_buf                = esp32s3_cam_set_buf,
  .validate_frame_setting = esp32s3_cam_validate_frame_setting,
  .start_capture          = esp32s3_cam_start_capture,
  .stop_capture           = esp32s3_cam_stop_capture,
  .alloc                  = esp32s3_cam_alloc,
  .free                   = esp32s3_cam_free,
};

static struct esp32s3_cam_s g_cam_priv =
{
  .data =
    {
      .ops = &g_cam_ops,
    },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: cam_interrupt
 *
 * Description:
 *   CAM VSYNC interrupt handler. Called when a frame is complete.
 *
 ****************************************************************************/

static int IRAM_ATTR cam_interrupt(int irq, void *context, void *arg)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)arg;
  uint32_t status = getreg32(LCD_CAM_LC_DMA_INT_ST_REG);

  /* Only handle CAM VSYNC interrupt */

  if (status & LCD_CAM_CAM_VSYNC_INT_ST_M)
    {
      /* Clear interrupt */

