apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam.c
      putreg32(LCD_CAM_CAM_VSYNC_INT_CLR_M,
               LCD_CAM_LC_DMA_INT_CLR_REG);

      if (priv->capturing)
        {
          priv->vsync_cnt++;

          /* First VSYNC = start of frame (DMA begins filling buffer).
           * Second VSYNC = end of frame (buffer is complete).
           */

          if (priv->vsync_cnt == 1)
            {
              /* Frame capture just started, DMA is now receiving data.
               * Nothing to do here — wait for next VSYNC.
               */
            }
          else if (priv->vsync_cnt >= 2 && priv->cb)
            {
              struct timeval ts;
              uint32_t regval;

              /* Stop capture and DMA before invoking callback.
               * The callback may call set_buf() which rewrites DMA
               * descriptors.  If DMA is still draining the CAM AFIFO
               * it could read half-written descriptors and follow a
               * corrupted pbuf pointer, writing pixel data over
               * unrelated memory (e.g. g_cam_priv.data.ops).
               */

              regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
              regval &= ~LCD_CAM_CAM_START_M;
              putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

              regval = getreg32(LCD_CAM_CAM_CTRL_REG);
              regval |= LCD_CAM_CAM_UPDATE_REG_M;
              putreg32(regval, LCD_CAM_CAM_CTRL_REG);

              /* Stop DMA channel before callback to prevent race */

              esp32s3_dma_reset_channel(priv->dma_channel, false);

              gettimeofday(&ts, NULL);

              /* Notify frame complete */

              priv->cb(0, priv->fb_size, &ts, priv->cb_arg);

              /* Check if callback called stop_capture.  With a
               * single-buffer FIFO the V4L2 layer stops capture
               * inside the callback; restarting DMA after that
               * would run unsynchronized and corrupt memory.
               */

              if (!priv->capturing)
                {
                  priv->vsync_cnt = 0;
                }
              else
                {
                  /* Restart capture for next frame */

                  priv->vsync_cnt = 0;

                  /* DMA channel was already reset before the
                   * callback above.  Reset CAM + AFIFO now.
                   */

                  /* Reset CAM + AFIFO */

                  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
                  regval |= LCD_CAM_CAM_RESET_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
                  regval &= ~LCD_CAM_CAM_RESET_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

                  regval |= LCD_CAM_CAM_AFIFO_RESET_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
                  regval &= ~LCD_CAM_CAM_AFIFO_RESET_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

                  /* Re-set REC_DATA_BYTELEN after reset */

                  regval &= ~LCD_CAM_CAM_REC_DATA_BYTELEN_M;
                  regval |= ((ESP32S3_CAM_DMA_BUFLEN - 1)
                             << LCD_CAM_CAM_REC_DATA_BYTELEN_S);
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

                  /* Reload DMA descriptors */

                  esp32s3_dma_load(priv->dmadesc, priv->dma_channel,
                                   false);
                  esp32s3_dma_enable(priv->dma_channel, false);

                  /* Restart */

                  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
                  regval |= LCD_CAM_CAM_START_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

                  regval = getreg32(LCD_CAM_CAM_CTRL_REG);
                  regval |= LCD_CAM_CAM_UPDATE_REG_M;
                  putreg32(regval, LCD_CAM_CAM_CTRL_REG);
                }
            }
        }
    }

  /* Clear any CAM HS interrupt too */

  if (status & LCD_CAM_CAM_HS_INT_ST_M)
    {
      putreg32(LCD_CAM_CAM_HS_INT_CLR_M,
               LCD_CAM_LC_DMA_INT_CLR_REG);
    }

  return 0;
}

/****************************************************************************
 * Name: esp32s3_cam_gpio_config
 *
 * Description:
 *   Configure GPIO pins for DVP camera interface.
 *
 ****************************************************************************/

static void esp32s3_cam_gpio_config(void)
{
  /* Data pins D0-D7 as input via GPIO matrix */

  esp_configgpio(CONFIG_ESP32S3_CAM_D0_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D0_PIN, CAM_DATA_IN0_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D1_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D1_PIN, CAM_DATA_IN1_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D2_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D2_PIN, CAM_DATA_IN2_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D3_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D3_PIN, CAM_DATA_IN3_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D4_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D4_PIN, CAM_DATA_IN4_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D5_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D5_PIN, CAM_DATA_IN5_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D6_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D6_PIN, CAM_DATA_IN6_IDX, false);

  esp_configgpio(CONFIG_ESP32S3_CAM_D7_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_D7_PIN, CAM_DATA_IN7_IDX, false);

  /* PCLK input */

  esp_configgpio(CONFIG_ESP32S3_CAM_PCLK_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_PCLK_PIN, CAM_PCLK_IDX, false);

  /* VSYNC input */

  esp_configgpio(CONFIG_ESP32S3_CAM_VSYNC_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_VSYNC_PIN, CAM_V_SYNC_IDX, false);

  /* HREF (H_ENABLE) input */

  esp_configgpio(CONFIG_ESP32S3_CAM_HREF_PIN, INPUT);
  esp_gpio_matrix_in(CONFIG_ESP32S3_CAM_HREF_PIN, CAM_H_ENABLE_IDX, false);

  /* XCLK output to sensor */

  esp_configgpio(CONFIG_ESP32S3_CAM_XCLK_PIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32S3_CAM_XCLK_PIN,
                      CAM_CLK_IDX, false, false);
}

/****************************************************************************
 * Name: esp32s3_cam_enableclk
 *
 * Description:
 *   Enable CAM clock and configure XCLK output.
 *
 ****************************************************************************/

static void esp32s3_cam_enableclk(void)
{
  uint32_t regval;

  /* Enable LCD_CAM peripheral clock (shared with LCD) */

