apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam.c
  periph_module_enable(PERIPH_LCD_CAM_MODULE);

  /* Configure CAM clock:
   *   CLK_SEL = 3 (PLL 160MHz)
   *   DIV_NUM = 6, DIV_A = 3, DIV_B = 2
   *   XCLK = 160 / (6 + 2/3) = 24 MHz
   */

  regval = (ESP32S3_CAM_CLK_SEL << LCD_CAM_CAM_CLK_SEL_S) |
           (ESP32S3_CAM_CLKM_DIV_A << LCD_CAM_CAM_CLKM_DIV_A_S) |
           (ESP32S3_CAM_CLKM_DIV_B << LCD_CAM_CAM_CLKM_DIV_B_S) |
           (ESP32S3_CAM_CLKM_DIV_NUM << LCD_CAM_CAM_CLKM_DIV_NUM_S) |
           LCD_CAM_CAM_VS_EOF_EN_M |  /* VSYNC triggers DMA EOF */
           (ESP32S3_CAM_VSYNC_FILTER << LCD_CAM_CAM_VSYNC_FILTER_THRES_S);
  putreg32(regval, LCD_CAM_CAM_CTRL_REG);
}

/****************************************************************************
 * Name: esp32s3_cam_dmasetup
 *
 * Description:
 *   Configure DMA for camera RX.
 *
 ****************************************************************************/

static int esp32s3_cam_dmasetup(struct esp32s3_cam_s *priv)
{
  priv->dma_channel = esp32s3_dma_request(ESP32S3_DMA_PERIPH_LCDCAM,
                                          1, 10, true);
  if (priv->dma_channel < 0)
    {
      snerr("ERROR: Failed to allocate GDMA channel\n");
      return -ENOMEM;
    }

  esp32s3_dma_set_ext_memblk(priv->dma_channel,
                             false,
                             ESP32S3_CAM_EXT_MEMBLK);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_config
 *
 * Description:
 *   Configure CAM controller registers and interrupts.
 *
 ****************************************************************************/

static int esp32s3_cam_config(struct esp32s3_cam_s *priv)
{
  int ret;
  uint32_t regval;
  irqstate_t flags;

  /* Reset CAM module and AFIFO first */

  regval = LCD_CAM_CAM_RESET_M | LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Configure CAM_CTRL1 after reset:
   *   - VSYNC filter enable
   *   - REC_DATA_BYTELEN = DMA node size - 1 (controls in_suc_eof)
   *   Note: 8-bit DVP sensor outputs BE RGB565 (high byte first).
   *         CAM_BYTE_ORDER only reverses bits within a byte in
   *         1-byte mode, so HW byte swap is not available here.
   *         Application must swap bytes if LE RGB565 is needed.
   */

  regval = LCD_CAM_CAM_VSYNC_FILTER_EN_M |
           ((ESP32S3_CAM_DMA_BUFLEN - 1) << LCD_CAM_CAM_REC_DATA_BYTELEN_S);
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Update registers */

  regval = getreg32(LCD_CAM_CAM_CTRL_REG);
  regval |= LCD_CAM_CAM_UPDATE_REG_M;
  putreg32(regval, LCD_CAM_CAM_CTRL_REG);

  /* Bypass RGB/YUV conversion (bit=0 means bypass) */

  putreg32(0, LCD_CAM_CAM_RGB_YUV_REG);

  /* Setup DMA */

  if (esp32s3_cam_dmasetup(priv) != OK)
    {
      return -ENOMEM;
    }

  /* Disable all LCD_CAM interrupts and clear pending */

  putreg32(0, LCD_CAM_LC_DMA_INT_ENA_REG);
  putreg32(0xffffffff, LCD_CAM_LC_DMA_INT_CLR_REG);

  /* Setup interrupt with CPU interrupts disabled.
   * Order matters:
   *   1) setup_irq creates cpuint → peripheral IRQ mapping
   *   2) irq_attach registers the handler for that IRQ
   * Since spin_lock_irqsave masks CPU interrupts, even if the
   * peripheral line is asserted after setup_irq, the interrupt
   * won't be serviced until after irq_attach completes.
   */

  flags = spin_lock_irqsave(&priv->lock);

  priv->cpu = this_cpu();

  /* 1) Map peripheral → CPU interrupt (creates IRQ mapping) */

  priv->cpuint = esp_setup_irq(ESP32S3_PERIPH_LCD_CAM,
                               ESP_IRQ_PRIORITY_DEFAULT,
                               ESP_IRQ_TRIGGER_LEVEL,
                               cam_interrupt,
                               priv);
  DEBUGASSERT(priv->cpuint >= 0);

  UNUSED(ret);

  /* 3) Clear any spurious interrupt that fired during setup */

  putreg32(0xffffffff, LCD_CAM_LC_DMA_INT_CLR_REG);

  spin_unlock_irqrestore(&priv->lock, flags);

  up_enable_irq(ESP32S3_IRQ_LCD_CAM);

  /* Enable CAM VSYNC interrupt in hardware */

  regval = getreg32(LCD_CAM_LC_DMA_INT_ENA_REG);
  regval |= LCD_CAM_CAM_VSYNC_INT_ENA_M;
  putreg32(regval, LCD_CAM_LC_DMA_INT_ENA_REG);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_init
 ****************************************************************************/

static int esp32s3_cam_init(struct imgdata_s *data)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)data;

  priv->capturing = false;
  priv->cb = NULL;
  priv->cb_arg = NULL;
  priv->fb = NULL;
  priv->fb_size = 0;
  priv->fb_pos = 0;
  priv->width = 0;
  priv->height = 0;
  priv->pixfmt = 0;

  spin_lock_init(&priv->lock);

  /* Allocate DMA descriptors from heap so they are isolated from
   * the driver struct.  If GDMA ever follows a stale/corrupted
   * descriptor it will scribble on heap, not on g_cam_priv.
   */

  if (priv->dmadesc == NULL)
    {
      priv->dmadesc = kmm_memalign(4,
                        sizeof(struct esp32s3_dmadesc_s) *
                        ESP32S3_CAM_DMADESC_NUM);
      if (priv->dmadesc == NULL)
        {
          snerr("ERROR: Failed to allocate DMA descriptors\n");
          return -ENOMEM;
        }
    }

  /* Configure GPIO pins */

  esp32s3_cam_gpio_config();

  /* Enable clock and configure XCLK */

  esp32s3_cam_enableclk();

  /* Configure CAM controller */

  return esp32s3_cam_config(priv);
}

/****************************************************************************
 * Name: esp32s3_cam_uninit
 ****************************************************************************/

static int esp32s3_cam_uninit(struct imgdata_s *data)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)data;
  uint32_t regval;
  irqstate_t flags;

  /* Stop capture */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_START_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Reset CAM module and AFIFO to stop all hardware activity */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval |= LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  regval |= LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

