apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam.c
  /* Keep XCLK running so the sensor stays accessible via I2C for
   * subsequent re-initialization.  VSYNC generation is already
   * stopped by the CAM_RESET above.  Disable only the CAM_START
   * bit in CAM_CTRL to stop the capture engine while preserving
   * the clock divider configuration.
   */

  regval = getreg32(LCD_CAM_CAM_CTRL_REG);
  regval &= ~LCD_CAM_CAM_UPDATE_REG_M;
  putreg32(regval, LCD_CAM_CAM_CTRL_REG);

  /* Stop and release DMA before tearing down the CPU-level IRQ.
   * esp32s3_dma_release() detaches the GDMA channel interrupt;
   * if DMA is still active it may fire after detach -> irq_unexpected.
   */

  if (priv->dma_channel >= 0)
    {
      esp32s3_dma_reset_channel(priv->dma_channel, false);
      esp32s3_dma_release(priv->dma_channel);
      priv->dma_channel = -1;
    }

  /* Mask CPU interrupts so no new peripheral interrupt can be
   * delivered between clearing the pending flag and detaching
   * the handler.  XCLK is still running (kept for I2C access),
   * so a VSYNC edge that arrived before the CAM_RESET could
   * still be latched in the interrupt controller.
   */

  flags = spin_lock_irqsave(&priv->lock);

  putreg32(0, LCD_CAM_LC_DMA_INT_ENA_REG);
  putreg32(0xffffffff, LCD_CAM_LC_DMA_INT_CLR_REG);

  up_disable_irq(ESP32S3_IRQ_LCD_CAM);
  esp_teardown_irq(ESP32S3_PERIPH_LCD_CAM, priv->cpuint);

  spin_unlock_irqrestore(&priv->lock, flags);

  /* Free DMA descriptors */

  if (priv->dmadesc)
    {
      kmm_free(priv->dmadesc);
      priv->dmadesc = NULL;
    }

  /* Free frame buffer only if driver allocated it */

  if (priv->fb && priv->fb_allocated)
    {
      kmm_free(priv->fb);
    }

  priv->fb = NULL;
  priv->fb_allocated = false;

  priv->capturing = false;

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_set_buf
 ****************************************************************************/

static int esp32s3_cam_set_buf(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               uint8_t *addr, uint32_t size)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)data;

  /* Store negotiated format from upper layer */

  priv->width  = datafmts[IMGDATA_FMT_MAIN].width;
  priv->height = datafmts[IMGDATA_FMT_MAIN].height;
  priv->pixfmt = datafmts[IMGDATA_FMT_MAIN].pixelformat;

  if (addr != NULL && size > 0)
    {
      priv->fb = addr;
      priv->fb_size = size;
      priv->fb_allocated = false;
    }
  else
    {
      /* Allocate frame buffer in PSRAM if available.
       * 8-bit DVP formats (RGB565, YUV422) are all 2 bytes per pixel.
       */

      priv->fb_size = priv->width * priv->height * 2;
      priv->fb = kmm_memalign(ESP32S3_CAM_DMA_ALIGN, priv->fb_size);
      if (!priv->fb)
        {
          snerr("ERROR: Failed to allocate frame buffer\n");
          return -ENOMEM;
        }

      priv->fb_allocated = true;
    }

  memset(priv->fb, 0, priv->fb_size);

  /* Setup DMA descriptors for RX into frame buffer */

  esp32s3_dma_setup(priv->dmadesc,
                    ESP32S3_CAM_DMADESC_NUM,
                    priv->fb,
                    priv->fb_size,
                    false,  /* RX */
                    priv->dma_channel);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_alloc
 *
 * Description:
 *   Allocate frame buffer memory with GDMA-required alignment.
 *   GDMA with EXT_MEMBLK_64B needs 64-byte aligned addresses
 *   for PSRAM access.
 *
 ****************************************************************************/

static void *esp32s3_cam_alloc(struct imgdata_s *data,
                               uint32_t align_size, uint32_t size)
{
  return kmm_memalign(ESP32S3_CAM_DMA_ALIGN, size);
}

/****************************************************************************
 * Name: esp32s3_cam_free
 ****************************************************************************/

static void esp32s3_cam_free(struct imgdata_s *data, void *addr)
{
  kmm_free(addr);
}

/****************************************************************************
 * Name: esp32s3_cam_validate_frame_setting
 ****************************************************************************/

static int esp32s3_cam_validate_frame_setting(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               imgdata_interval_t *interval)
{
  if (nr_datafmts < 1 || !datafmts)
    {
      return -EINVAL;
    }

  /* Pixel format is validated by the sensor driver (imgsensor);
   * imgdata only checks that width and height are non-zero.
   */

  if (datafmts[IMGDATA_FMT_MAIN].width == 0 ||
      datafmts[IMGDATA_FMT_MAIN].height == 0)
    {
      return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_start_capture
 ****************************************************************************/

static int esp32s3_cam_start_capture(struct imgdata_s *data,
                               uint8_t nr_datafmts,
                               imgdata_format_t *datafmts,
                               imgdata_interval_t *interval,
                               imgdata_capture_t callback,
                               void *arg)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)data;
  uint32_t regval;

  if (priv->capturing)
    {
      return -EBUSY;
    }

  if (!priv->fb)
    {
      return -EINVAL;
    }

  priv->cb = callback;
  priv->cb_arg = arg;
  priv->fb_pos = 0;
  priv->vsync_cnt = 0;

  /* Stop CAM first */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_START_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Reset CAM module + AFIFO (match esp32-camera ll_cam_start) */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval |= LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  regval |= LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Reset DMA channel */

  esp32s3_dma_reset_channel(priv->dma_channel, false);

  /* Re-set REC_DATA_BYTELEN after reset (reference does this) */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_REC_DATA_BYTELEN_M;
  regval |= ((ESP32S3_CAM_DMA_BUFLEN - 1) << LCD_CAM_CAM_REC_DATA_BYTELEN_S);
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Load DMA descriptors */

