apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam.c
  esp32s3_dma_load(priv->dmadesc, priv->dma_channel, false);
  esp32s3_dma_enable(priv->dma_channel, false);

  /* Start capture */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval |= LCD_CAM_CAM_START_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Update registers */

  regval = getreg32(LCD_CAM_CAM_CTRL_REG);
  regval |= LCD_CAM_CAM_UPDATE_REG_M;
  putreg32(regval, LCD_CAM_CAM_CTRL_REG);

  priv->capturing = true;

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_stop_capture
 ****************************************************************************/

static int esp32s3_cam_stop_capture(struct imgdata_s *data)
{
  struct esp32s3_cam_s *priv = (struct esp32s3_cam_s *)data;
  uint32_t regval;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  /* Mark not capturing first so ISR won't process further VSYNCs */

  priv->capturing = false;
  priv->cb = NULL;
  priv->cb_arg = NULL;

  /* Stop capture engine */

  regval = getreg32(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_START_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  /* Reset CAM + AFIFO to fully quiesce hardware */

  regval |= LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  regval |= LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_AFIFO_RESET_M;
  putreg32(regval, LCD_CAM_CAM_CTRL1_REG);

  regval = getreg32(LCD_CAM_CAM_CTRL_REG);
  regval |= LCD_CAM_CAM_UPDATE_REG_M;
  putreg32(regval, LCD_CAM_CAM_CTRL_REG);

  /* Reset DMA channel to abort any in-flight transfer */

  esp32s3_dma_reset_channel(priv->dma_channel, false);

  /* Clear any pending VSYNC interrupt */

  putreg32(LCD_CAM_CAM_VSYNC_INT_CLR_M,
           LCD_CAM_LC_DMA_INT_CLR_REG);

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_cam_initialize
 *
 * Description:
 *   Initialize the ESP32-S3 CAM imgdata driver.
 *   Starts XCLK output for sensor communication.
 *
 * Returned Value:
 *   Pointer to imgdata_s on success; NULL on failure.
 *
 ****************************************************************************/

struct imgdata_s *esp32s3_cam_initialize(void)
{
  /* Start XCLK output to sensor — must be running before
   * sensor I2C communication (e.g. gc0308_initialize).
   */

  esp_configgpio(CONFIG_ESP32S3_CAM_XCLK_PIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32S3_CAM_XCLK_PIN,
                      CAM_CLK_IDX, false, false);
  esp32s3_cam_enableclk();

  return &g_cam_priv.data;
}
